wallCondensationCoupled/testCase/0/bottomAir/qr
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/bottomAir";
    object      qr;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 1 0 -3 0 0 0 0 ];

internalField   uniform 0;

boundaryField
{
    "(min|max)(X|Y|Z)"
    {
        type            greyDiffusiveRadiationViewFactor;
        value           $internalField;
        emissivityMode  lookup;
        qro             uniform 0;
        emissivity      uniform 1;
    }
    "bottomAir_to_.*"
    {
        type            greyDiffusiveRadiationViewFactor;
        value           $internalField;
        emissivityMode  solidRadiation;
        qro             uniform 0;
        emissivity      uniform 1;
    }
}


// ************************************************************************* //
